Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/include/pic32cm1216ls00032.h
#define AUX3_SIZE                      _UINT32_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX3_PAGE_SIZE                 _UINT32_(        64)
#define AUX3_NB_OF_PAGES               _UINT32_(         4)

#define AUX4_SIZE                      _UINT32_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX4_PAGE_SIZE                 _UINT32_(        64)
#define AUX4_NB_OF_PAGES               _UINT32_(         4)

#define AUX5_SIZE                      _UINT32_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX5_PAGE_SIZE                 _UINT32_(        64)
#define AUX5_NB_OF_PAGES               _UINT32_(         4)

#define BOCOR_SIZE                     _UINT32_(0x00000100)    /*    0kB Memory segment type: fuses */
#define BOCOR_PAGE_SIZE                _UINT32_(        64)
#define BOCOR_NB_OF_PAGES              _UINT32_(         4)

#define BOCOR1_SIZE                    _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define CAL_SIZE                       _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define DATAFLASH_SIZE                 _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define DATAFLASH_PAGE_SIZE            _UINT32_(        64)
#define DATAFLASH_NB_OF_PAGES          _UINT32_(        64)

#define LOCKROW_SIZE                   _UINT32_(0x00000004)    /*    0kB Memory segment type: fuses */
#define OTP1_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP2_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP3_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP4_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define ROM_SIZE                       _UINT32_(0x00010000)    /*   64kB Memory segment type: fuses */
#define ROM_PAGE_SIZE                  _UINT32_(        64)
#define ROM_NB_OF_PAGES                _UINT32_(      1024)

#define SHADOW_SIZE                    _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define SW_CALIB_SIZE                  _UINT32_(0x00000004)    /*    0kB Memory segment type: fuses */
#define TLATCH_SIZE                    _UINT32_(0x00010000)    /*   64kB Memory segment type: fuses */
#define TLATCH_PAGE_SIZE               _UINT32_(        64)
#define TLATCH_NB_OF_PAGES             _UINT32_(      1024)

#define USER_PAGE_SIZE                 _UINT32_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UINT32_(        64)
#define USER_PAGE_NB_OF_PAGES          _UINT32_(         4)

#define HSRAM_SIZE                     _UINT32_(0x00004000)    /*   16kB Memory segment type: ram */
#define APBA_SIZE                      _UINT32_(0x00008000)    /*   32kB Memory segment type: io */
#define APBB_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define APBC_SIZE                      _UINT32_(0x00006000)    /*   24kB Memory segment type: io */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */

#define FLASH_ADDR                     _UINT32_(0x00000000)    /* FLASH base address (type: flash)*/
#define AUX0_ADDR                      _UINT32_(0x00804000)    /* AUX0 base address (type: fuses)*/
#define AUX1_ADDR                      _UINT32_(0x00806000)    /* AUX1 base address (type: fuses)*/
#define AUX2_ADDR                      _UINT32_(0x00808000)    /* AUX2 base address (type: fuses)*/
#define AUX3_ADDR                      _UINT32_(0x0080a000)    /* AUX3 base address (type: fuses)*/
#define AUX4_ADDR                      _UINT32_(0x0080c000)    /* AUX4 base address (type: fuses)*/
#define AUX5_ADDR                      _UINT32_(0x0080e000)    /* AUX5 base address (type: fuses)*/
#define BOCOR_ADDR                     _UINT32_(0x0080c000)    /* BOCOR base address (type: fuses)*/
#define BOCOR1_ADDR                    _UINT32_(0x0080c008)    /* BOCOR1 base address (type: fuses)*/
#define CAL_ADDR                       _UINT32_(0x00800000)    /* CAL base address (type: fuses)*/
#define DATAFLASH_ADDR                 _UINT32_(0x00400000)    /* DATAFLASH base address (type: flash)*/
#define LOCKROW_ADDR                   _UINT32_(0x00802000)    /* LOCKROW base address (type: fuses)*/
#define OTP1_ADDR                      _UINT32_(0x00806000)    /* OTP1 base address (type: fuses)*/
#define OTP2_ADDR                      _UINT32_(0x00806008)    /* OTP2 base address (type: fuses)*/
#define OTP3_ADDR                      _UINT32_(0x00806010)    /* OTP3 base address (type: fuses)*/
#define OTP4_ADDR                      _UINT32_(0x00806018)    /* OTP4 base address (type: fuses)*/
#define ROM_ADDR                       _UINT32_(0x00830000)    /* ROM base address (type: fuses)*/
#define SHADOW_ADDR                    _UINT32_(0x00820000)    /* SHADOW base address (type: fuses)*/
#define SW_CALIB_ADDR                  _UINT32_(0x00806020)    /* SW_CALIB base address (type: fuses)*/
#define TLATCH_ADDR                    _UINT32_(0x00810000)    /* TLATCH base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UINT32_(0x00804000)    /* USER_PAGE base address (type: user_page)*/
#define HSRAM_ADDR                     _UINT32_(0x20000000)    /* HSRAM base address (type: ram)*/
#define APBA_ADDR                      _UINT32_(0x40000000)    /* APBA base address (type: io)*/
#define APBB_ADDR                      _UINT32_(0x41000000)    /* APBB base address (type: io)*/
#define APBC_ADDR                      _UINT32_(0x42000000)    /* APBC base address (type: io)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR PIC32CM1216LS00032                                 */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X2085200B)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CM1216LS00032                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* Event Generator IDs for C32CM1216LS00032 */
/* ************************************************************************** */
#define EVENT_ID_GEN_OSCCTRL_XOSC_FAIL                    1 /* ID for OSCCTRL event generator XOSC_FAIL */
#define EVENT_ID_GEN_OSC32KCTRL_XOSC32K_FAIL              2 /* ID for OSC32KCTRL event generator XOSC32K_FAIL */
#define EVENT_ID_GEN_SUPC_BOD33DET                        3 /* ID for SUPC event generator BOD33DET */
#define EVENT_ID_GEN_RTC_PER_0                            4 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            5 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            6 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            7 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            8 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            9 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           10 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           11 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_RTC_CMP_0                           12 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                           13 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_TAMPER                          14 /* ID for RTC event generator TAMPER */
#define EVENT_ID_GEN_RTC_OVF                             15 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PERD                            16 /* ID for RTC event generator PERD */
#define EVENT_ID_GEN_EIC_EXTINT_0                        17 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        18 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        19 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        20 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        21 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        22 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        23 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        24 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_DMAC_CH_0                           25 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           26 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           27 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           28 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_DMAC_CH_4                           29 /* ID for DMAC event generator CH_4 */
#define EVENT_ID_GEN_DMAC_CH_5                           30 /* ID for DMAC event generator CH_5 */
#define EVENT_ID_GEN_DMAC_CH_6                           31 /* ID for DMAC event generator CH_6 */
#define EVENT_ID_GEN_DMAC_CH_7                           32 /* ID for DMAC event generator CH_7 */
#define EVENT_ID_GEN_TC0_OVF                             33 /* ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            34 /* ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            35 /* ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             36 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            37 /* ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            38 /* ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             39 /* ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            40 /* ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            41 /* ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_ADC_RESRDY                          42 /* ID for ADC event generator RESRDY */
#define EVENT_ID_GEN_ADC_WINMON                          43 /* ID for ADC event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           44 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           45 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            46 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_DAC_EMPTY_0                         47 /* ID for DAC event generator EMPTY_0 */
#define EVENT_ID_GEN_DAC_EMPTY_1                         48 /* ID for DAC event generator EMPTY_1 */
#define EVENT_ID_GEN_PTC_EOC                             49 /* ID for PTC event generator EOC */
#define EVENT_ID_GEN_PTC_WCOMP                           50 /* ID for PTC event generator WCOMP */
#define EVENT_ID_GEN_TRNG_READY                          51 /* ID for TRNG event generator READY */
#define EVENT_ID_GEN_CCL_LUTOUT_0                        52 /* ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                        53 /* ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_PAC_ACCERR                          54 /* ID for PAC event generator ACCERR */

/* ************************************************************************** */
/*  Event User IDs for C32CM1216LS00032 */
/* ************************************************************************** */
#define EVENT_ID_USER_OSCCTRL_TUNE                        0 /* ID for OSCCTRL event user TUNE */
#define EVENT_ID_USER_RTC_TAMPER                          1 /* ID for RTC event user TAMPER */
#define EVENT_ID_USER_NVMCTRL_PAGEW                       2 /* ID for NVMCTRL event user PAGEW */
#define EVENT_ID_USER_PORT_EV_0                           3 /* ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           4 /* ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           5 /* ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           6 /* ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMAC_CH_0                           7 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           8 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           9 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                          10 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_DMAC_CH_4                          11 /* ID for DMAC event user CH_4 */
#define EVENT_ID_USER_DMAC_CH_5                          12 /* ID for DMAC event user CH_5 */
#define EVENT_ID_USER_DMAC_CH_6                          13 /* ID for DMAC event user CH_6 */
#define EVENT_ID_USER_DMAC_CH_7                          14 /* ID for DMAC event user CH_7 */
#define EVENT_ID_USER_TC0_EVU                            15 /* ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            16 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            17 /* ID for TC2 event user EVU */
#define EVENT_ID_USER_ADC_START                          18 /* ID for ADC event user START */
#define EVENT_ID_USER_ADC_SYNC                           19 /* ID for ADC event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           20 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           21 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_DAC_START_0                        22 /* ID for DAC event user START_0 */
#define EVENT_ID_USER_DAC_START_1                        23 /* ID for DAC event user START_1 */
#define EVENT_ID_USER_PTC_STCONV                         24 /* ID for PTC event user STCONV */
#define EVENT_ID_USER_PTC_DSEQR                          25 /* ID for PTC event user DSEQR */
#define EVENT_ID_USER_CCL_LUTIN_0                        26 /* ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        27 /* ID for CCL event user LUTIN_1 */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CM1216LS00032_H_ */

